# specify a directory to install
cask_args appdir: '/Applications'

# install packages
brew 'nvim'
brew 'grep'
brew 'jq'

# Install Bash 4.
# Note: don’t forget to add `/usr/local/bin/bash` to `/etc/shells` before
# running `chsh`.
brew 'bash'
brew 'bash-completion2'

brew 'zsh'

# Install other useful binaries.
brew 'git'
brew 'git-lfs'
brew 'lua'

# Tmate
brew 'tmux'
brew 'tmate'

# languages
brew 'golang'
brew 'python'
brew 'pipx'
brew 'node'

# k8s
brew 'kubernetes-cli'
brew 'kubectx'

# version managers
brew 'nvm'
brew 'gvm'

# casks
cask 'docker'
cask 'iterm2'

