# specify a directory to install
cask_args appdir: '/Applications'

# osx
tap 'homebrew/cask'
tap 'homebrew/cask/fonts'
tap 'buo/cask-upgrade'
brew 'mas'

# install packages
brew 'nvim'
brew 'grep'
brew 'jq'

# Install Bash 4.
# Note: don’t forget to add `/usr/local/bin/bash` to `/etc/shells` before
# running `chsh`.
brew 'bash'
brew 'bash-completion2'

brew 'zsh'

# Install other useful binaries.
brew 'git'
brew 'git-lfs'
brew 'gh'
brew 'github-keygen'
brew 'pre-commit'
brew 'lua'

# lualinter
brew 'stylua'

# Tmate
brew 'tmux'
brew 'tmate'

# languages
brew 'golang'
brew 'node'

# k8s
brew 'kubernetes-cli'
brew 'kubectx'

# version managers
brew 'nvm'

# casks
cask 'docker'
cask 'iterm2'
cask 'font-go-mono-nerd-font'
