
# tap repositories and their packages

tap 'homebrew/core'
brew 'ack'
brew 'adns'
brew 'adwaita-icon-theme'
brew 'ant'
brew 'aom'
brew 'atk'
brew 'autoconf'
brew 'automake'
brew 'aws-iam-authenticator'
brew 'awscli'
brew 'bash'
brew 'bash-completion@2'
brew 'bdw-gc'
brew 'berkeley-db'
brew 'bfg'
brew 'binutils'
brew 'binwalk'
brew 'brotli'
brew 'c-ares'
brew 'ca-certificates'
brew 'cairo'
brew 'cifer'
brew 'coreutils'
brew 'dex2jar'
brew 'direnv'
brew 'dns2tcp'
brew 'docbook'
brew 'docbook-xsl'
brew 'docutils'
brew 'elasticsearch'
brew 'erlang'
brew 'fcrackzip'
brew 'fd'
brew 'findutils'
brew 'flux'
brew 'fluxctl'
brew 'fontconfig'
brew 'foremost'
brew 'freetype'
brew 'fribidi'
brew 'fzf'
brew 'gcc'
brew 'gd'
brew 'gdbm'
brew 'gdk-pixbuf'
brew 'gettext'
brew 'gh'
brew 'ghostscript'
brew 'giflib'
brew 'git'
brew 'git-filter-repo'
brew 'git-lfs'
brew 'glib'
brew 'gmp'
brew 'gnu-getopt'
brew 'gnu-sed'
brew 'gnumeric'
brew 'gnupg'
brew 'gnutls'
brew 'go@1.14'
brew 'gobject-introspection'
brew 'goffice'
brew 'golang'
brew 'graphite2'
brew 'graphviz'
brew 'grep'
brew 'gsettings-desktop-schemas'
brew 'gtk+3'
brew 'gts'
brew 'guile'
brew 'harfbuzz'
brew 'hashpump'
brew 'helm'
brew 'hicolor-icon-theme'
brew 'highway'
brew 'hydra'
brew 'icu4c'
brew 'ilmbase'
brew 'imagemagick'
brew 'imath'
brew 'isl'
brew 'itstool'
brew 'jasper'
brew 'jbig2dec'
brew 'jemalloc'
brew 'john'
brew 'jpeg'
brew 'jpeg-turbo'
brew 'jpeg-xl'
brew 'jq'
brew 'k6'
brew 'k9s'
brew 'knock'
brew 'krb5'
brew 'kubectx'
brew 'kubernetes-cli'
brew 'ldns'
brew 'libassuan'
brew 'libavif'
brew 'libcbor'
brew 'libde265'
brew 'libdnet'
brew 'libepoxy'
brew 'libev'
brew 'libevent'
brew 'libffi'
brew 'libfido2'
brew 'libgcrypt'
brew 'libgpg-error'
brew 'libgsf'
brew 'libheif'
brew 'libice'
brew 'libidn'
brew 'libidn2'
brew 'libimagequant'
brew 'libksba'
brew 'liblqr'
brew 'libmpc'
brew 'libnghttp2'
brew 'libomp'
brew 'libpng'
brew 'libpthread-stubs'
brew 'libraqm'
brew 'libraw'
brew 'librsvg'
brew 'libsm'
brew 'libsodium'
brew 'libssh'
brew 'libtasn1'
brew 'libtermkey'
brew 'libtiff'
brew 'libtool'
brew 'libunistring'
brew 'libusb'
brew 'libuv'
brew 'libvmaf'
brew 'libvterm'
brew 'libx11'
brew 'libxau'
brew 'libxcb'
brew 'libxdmcp'
brew 'libxext'
brew 'libxml2'
brew 'libxmu'
brew 'libxrender'
brew 'libxt'
brew 'libyaml'
brew 'little-cms2'
brew 'lua'
brew 'luajit'
brew 'luv'
brew 'lynx'
brew 'lz4'
brew 'lzo'
brew 'm4'
brew 'minikube'
brew 'mockery'
brew 'moreutils'
brew 'mpdecimal'
brew 'mpfr'
brew 'msgpack'
brew 'mysql'
brew 'mysql-client'
brew 'mysql@5.6'
brew 'ncurses'
brew 'netpbm'
brew 'nettle'
brew 'nghttp2'
brew 'nmap'
brew 'node'
brew 'npth'
brew 'numpy'
brew 'nvim'
brew 'nvm'
brew 'oniguruma'
brew 'openblas'
brew 'openexr'
brew 'openjdk@11'
brew 'openjdk@8'
brew 'openjpeg'
brew 'openssh'
brew 'openssl@1.1'
brew 'openssl@3'
brew 'p11-kit'
brew 'p7zip'
brew 'pango'
brew 'pcre'
brew 'pcre2'
brew 'perl'
brew 'pigz'
brew 'pillow'
brew 'pinentry'
brew 'pipx'
brew 'pixman'
brew 'pkg-config'
brew 'pngcheck'
brew 'pre-commit'
brew 'protobuf'
brew 'protobuf@21'
brew 'pv'
brew 'python@3.10'
brew 'python@3.11'
brew 'python@3.8'
brew 'python@3.9'
brew 'pyyaml'
brew 'qt'
brew 'qt@5'
brew 'rabbitmq'
brew 'rarian'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 'rename'
brew 'ripgrep'
brew 'rlwrap'
brew 'ruby'
brew 'saml2aws'
brew 'screen'
brew 'shared-mime-info'
brew 'six'
brew 'socat'
brew 'speedtest-cli'
brew 'sqlite'
brew 'sqlmap'
brew 'ssdeep'
brew 'ssh-copy-id'
brew 'stow'
brew 'tcl-tk'
brew 'tcpflow'
brew 'tcpreplay'
brew 'tcptrace'
brew 'tektoncd-cli'
brew 'terraform'
brew 'tfenv'
brew 'tmate'
brew 'tmux'
brew 'tree'
brew 'tree-sitter'
brew 'ucspi-tcp'
brew 'unbound'
brew 'unibilium'
brew 'unixodbc'
brew 'utf8proc'
brew 'vbindiff'
brew 'vim'
brew 'virtualenv'
brew 'webp'
brew 'wemux'
brew 'wget'
brew 'woff2'
brew 'x265'
brew 'xclip'
brew 'xmlto'
brew 'xorgproto'
brew 'xpdf'
brew 'xz'
brew 'yarn'
brew 'zlib'
brew 'zopfli'
brew 'zsh'
brew 'zstd'

tap 'homebrew/cask'
cask 'android-ndk'
cask 'android-platform-tools'
cask 'android-sdk'
cask 'docker'
cask 'flux'
cask 'iterm2'
cask 'ngrok'
cask 'shifty'

tap 'homebrew/bundle'

tap 'homebrew/cask-fonts'
cask 'font-go-mono-nerd-font'
cask 'font-jetbrains-mono-nerd-font'

tap 'homebrew/services'

tap 'bramstein/webfonttools'
brew 'sfnt2woff'
brew 'sfnt2woff-zopfli'

tap 'fluxcd/tap'

tap 'rcmdnk/file'
brew 'brew-file'

tap 'vektra/tap'

tap 'versent/taps'

# App Store applications
mas 'GarageBand (10.4.8)', id: 682658836
mas 'iMovie (10.3.6)', id: 408981434
mas 'Keynote (13.1)', id: 409183694
mas 'Numbers (13.1)', id: 409203825
mas 'Pages (13.1)', id: 409201541
mas 'RAR Extractor (10.5.0)', id: 1521938791
